app/views/users/_profile.html.erb

SELECT COUNT(*) FROM "relationships" WHERE "relationships"."follower_id" = ?  [["follower_id", 1]]
---
	    <th>follows</th><th><%= link_to "#{user.active_relationships.count} ", follows_user_path(user.id) %></tr>
	    <th>followers</th><th><%= link_to "#{user.passive_relationships.count} ", followers_user_path(user.id) %></th>