app/views/books/show.html.erb

SELECT COUNT(*) FROM "relationships" WHERE "relationships"."follower_id" = ?  [["follower_id", 1]]
---
	    <th>follows</th><th><%= link_to "#{@user.active_relationships.count} ", follows_user_path %></tr>
	    <th>followers</th><th><%= link_to "#{@user.passive_relationships.count} ", followers_user_path %></th>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
                        <div class="float-wrapper">
                          <div class="comment-count">コメント数：<%= @book.book_comments.count %></div>