app/controllers/books_controller.rb

  def show
    @book = Book.find(params[:id])
     @user = User.find(@book.user_id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
  if  @book.save
   flash[:notice] = "book was successfully created."
   redirect_to '/books'#book_path(@book.id)
  else
    @books = Book.all
---
INSERT INTO "books" ("title", "user_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "book1"], ["user_id", 1], ["body", "book1"], ["created_at", "2020-10-28 03:17:29.570878"], ["updated_at", "2020-10-28 03:17:29.570878"]]
SELECT "books".* FROM "books"

  def update
    book = Book.find(params[:id])
  if book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "book0"], ["body", "book0"], ["updated_at", "2020-10-28 03:17:43.553600"], ["id", 1]]

  def destroy
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]