app/controllers/books_controller.rb

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ? ORDER BY "book_comments"."created_at" DESC  [["book_id", 1]]
SELECT "users".* FROM "users"
---
  def show
    @book_new = Book.new
    @book = Book.find(params[:id])
    @user = @book.user
    @book_comment = BookComment.new
    @book_comments = BookComment.all
    @users = User.all