app/controllers/book_comments_controller.rb

  def create
   	book = Book.find(params[:book_id])
    @book_comment = current_user.book_comments.new(book_comment_params)
  	@book_comment.book_id = book.id
    @book_comments = BookComment.all
  	@book_comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
INSERT INTO "book_comments" ("book_comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["book_comment", "aaaaa"], ["user_id", 1], ["book_id", 1], ["created_at", "2020-11-10 04:39:36.835764"], ["updated_at", "2020-11-10 04:39:36.835764"]]

  def destroy
    BookComment.find_by(id: params[:id], book_id: params[:book_id]).destroy
---
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["id", 1], ["book_id", 1], ["LIMIT", 1]]