app/controllers/relationships_controller.rb

INSERT INTO "relationships" ("followed_id", "follower_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["followed_id", 2], ["follower_id", 1], ["created_at", "2020-11-04 07:39:35.700870"], ["updated_at", "2020-11-04 07:39:35.700870"]]
---
  def create
    follow = current_user.active_relationships.build(follower_id: params[:user_id])
    follow.save

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]
---
  def destroy
    follow = current_user.active_relationships.find_by(follower_id: params[:user_id])
    follow.destroy