app/controllers/users_controller.rb

  def index
    @book = Book.new
    @books = Book.all
    @users = User.all
---
SELECT "users".* FROM "users"

  def show
    @book_new = Book.new
    @users = User.all
    @user = User.find(params[:id])
    @books = @user.books.all
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]

  def update
    @user = User.find(params[:id])
   if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "773627f7f49e7dc12d88a62a306aae8629c027f9a97a076027c2287e2573"], ["introduction", ""], ["updated_at", "2020-11-02 14:37:06.836245"], ["id", 1]]

  def follows
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def followers
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]